# Повторення
# Виникає помилка TypeError, тому що Python не може напряму додати рядок "5" і ціле число 5
# Якщо після b = a змінити a, то b залишиться незмінним, бо отримує поточне значення a, а не постійний зв’язок із нею.

# Задачі

# 1
print("Python", "це", "круто", sep="|")


# 2
print("Привіт", end=" ")
print("світ")


# 3
name = input("Введіть ім'я: ")
city = input("Введіть місто: ")
print(f"Привіт, {name} з {city}!")


# 4
num1 = int(input("Введіть число 1: "))
num2 = int(input("Введіть число 2: "))
print(num1 + num2)
# якщо без приведення до числа тобто без int() то буде зклейка двух рядків

# перевірка
# ❯ python3 hello.py 
# Введіть число 1: 5
# Введіть число 2: 6
# 56

#input() завжди повертає рядки. два числа це рядки а + зклеює ці рядки


# 5
price = float(input("Введіть ціну товару: "))
quantity = int(input("Введіть кількість: "))
total = price * quantity
print(f"Разом: {total:.2f} грн")


#6
print("Меню:\n\t1. Борщ\n\t2. Вареники")


#7 
# думаю буде помилка TypeError тому що age залишився рядком а рядок + число це помилка

# виправив код
age = int(input("Вік: "))
print(f"Через 10 років тобі буде {age + 10}")